app/Controllers/Film.php

SELECT *
FROM `films`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `films`
---
    public function index()
    {
        $filmmodel  = new FilmModel();
        $pager      = \Config\Services::pager();
        $data       = array(
            'films'  => $filmmodel->paginate(4, 'film')
        );

INSERT INTO `films` (`judul`, `rilis`, `deskripsi`) VALUES ('halodek', '0011-11-11', 'iya??')
---
    public function cek()
    {
        helper(['form', 'url']);

        $validation = $this->validate([
            'judul' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Inputkan judul FILM terlebih dahulu!'
                ]
            ],
            'rilis' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Inputkan tanggal rilis FILM terlebih dahulu!'
                ]
            ],
            'deskripsi' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Inputkan deskripsi FILM terlebih dahulu!'
                ]
            ],
        ]);
        if (!$validation) {
            return view('form-tambah', [
                'validator' => $this->validator
            ]);
        } else {
            $filmmodel = new FilmModel();
            $filmmodel->insert([
                'judul' => $this->request->getPost('judul'),
                'rilis' => $this->request->getPost('rilis'),
                'deskripsi' => $this->request->getPost('deskripsi'),
            ]);

SELECT *
FROM `films`
WHERE `films`.`id` = '7'
---
    public function edit($id)
    {
        $filmmodel = new FilmModel();
        $data = array(
            'films' => $filmmodel->find($id)
        );